In [ ]:
# 상관분석
# 트레이닝데이터 -> 알고리즘(ML,delattr)) -> 모델 -> 예측결과 출력
# 테스트데이터 ----------------------> 입력

In [2]:
import pandas as pd

train=pd.read_csv('../titanic/train.csv')
test=pd.read_csv('../titanic/test.csv')
train.shape # (891,12)
test.shape # (418,11)
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [3]:
submission=pd.read_csv('../titanic/gender_submission.csv')

In [4]:
train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [5]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
# train 데이터에서 성별에 따른 생존율 출력

train.sample(10)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
434          435         0       1  ...  55.9000   E44         S
673          674         1       2  ...  13.0000   NaN         S
413          414         0       2  ...   0.0000   NaN         S
247          248         1       2  ...  14.5000   NaN         S
284          285         0       1  ...  26.0000   A19         S
326          327         0       3  ...   6.2375   NaN         S
404          405         0       3  ...   8.6625   NaN         S
190          191         1       2  ...  13.0000   NaN         S
546          547         1       2  ...  26.0000   NaN         S
70            71         0       2  ...  10.5000   NaN         S

[10 rows x 12 columns]

In [10]:
train.groupby("Sex")["Survived"].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [19]:
import numpy as np

train.pivot_table(index=['Sex'], values=['Survived'], aggfunc=np.mean)

        Survived
Sex
female  0.742038
male    0.188908

In [21]:
train.pivot_table(index=['Sex'], values=['Survived'])
#디폴트값 : aggfunc = np.mean

        Survived
Sex
female  0.742038
male    0.188908

In [22]:
train.pivot_table(index=['Sex'])

              Age       Fare     Parch  ...    Pclass     SibSp  Survived
Sex                                     ...
female  27.915709  44.479818  0.649682  ...  2.159236  0.694268  0.742038
male    30.726645  25.523893  0.235702  ...  2.389948  0.429809  0.188908

[2 rows x 7 columns]

In [13]:
import matplotlib as plt

plt.plot(trian, train.Fare, train.Survived)

AttributeError: module 'matplotlib' has no attribute 'plot'

In [24]:
train.groupby('Sex')['Survived'].describe()

        count      mean       std  min  25%  50%  75%  max
Sex
female  314.0  0.742038  0.438211  0.0  0.0  1.0  1.0  1.0
male    577.0  0.188908  0.391775  0.0  0.0  0.0  0.0  1.0

In [26]:
#성별, 선실등급별 생존율

train.groupby(['Sex','Pclass'])['Survived'].mean()
train.pivot_table(index=['Sex','Pclass'], values=['Survived']) #api문서에 가면 인수규칙이 나와있다.

               Survived
Sex    Pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [ ]:
# 이제까지 탐색적데이터분석을 했다 (eda) 시각화를 안했다뿐이다.

In [42]:
#모델링
test['Survived'] = test.Sex=='female'

In [43]:
test.head()
test['Survived'].value_counts()
submission = test[['PassengerId','Survived']].copy()
submission.head()

   PassengerId  Survived
0          892     False
1          893      True
2          894     False
3          895     False
4          896      True

In [44]:
submission['Survived'] = submission['Survived'].astype(int)
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [47]:
submission.to_csv("submission.csv", index=False)